using System;
using System.Collections.Generic;
using System.Linq;
using System.Threading.Tasks;

namespace CisNet.Types
{
    public class Bypass
    {
        public decimal ID { get; set; }
        public DateTime DocDate { get; set; }

        public DateTime EventDate { get; set; }
        public string TypeName { get; set; }
        public string Staff { get; set; }
        public string Remark { get; set; }
        public string ObjCaption { get; set; }
        public decimal P108 { get; set; }
        public decimal P124 { get; set; }
        public decimal P138 { get; set; }
        public decimal P183 { get; set; }
        public decimal P314 { get; set; }
        public decimal P363 { get; set; }
        public decimal P405 { get; set; }
        public decimal P758 { get; set; }
        public decimal P778 { get; set; }
        public string Info { get; set; }
        public string Zverid { get; set; }
        public string ZverContract { get; set; }
        public decimal Object_id { get; set; }

        public static List<Bypass> getTestData()
        {
            List<Bypass> rez = new List<Bypass>();
            Bypass p = new Bypass()
            {
                ID = 10000000000001024633,
                DocDate = new DateTime(2021, 12, 09, 09, 07, 39),
                EventDate = new DateTime(2021, 12, 16),
                TypeName = "увольнение",
                Staff = "Москва | Региональное представительство | Маркетолог",
                Remark = "Собственное желание",
                ObjCaption = "Гаевая Валентина Анатольевна| 29.05.1990",
                P108 = 0,
                P124 = 0,
                P138 = 0,
                P183 = 1,
                P314 = 2,
                P363 = 0,
                P405 = 0,
                P758 = 2,
                P778 = 0,
                Info = "",
                Object_id = 1000002353777773,
                ZverContract = "АДМЗР",
                Zverid = "ГАЕВАЯ ВА"

            };
            p.Info = @"Отдел 138->Дата: 15.12.2021; Оператор: Бектемиров Марс Акылбекович | 06.09.1973; Долги: Нет долгов -> Нет долгов; Прислал документ : Автопроверка остатков
Отдел 183->Дата: 09.12.2021; Оператор: Бектемиров Марс Акылбекович | 06.09.1973; Долги: Есть долги -> Есть долги по КИС Глобус; Прислал документ : Автопроверка остатков
Отдел 314->Не проверен
Отдел 405->Дата: 16.12.2021; Оператор: Петрунин Антон Александрович | 04.06.1975; Долги: Нет долгов -> Нет долгов; Прислал документ : Автопроверка остатков
Отдел 778->Дата: 16.12.2021; Оператор: Урманцев Борис Маратович | 12.11.1981; Долги: Нет долгов
Отдел 363->Дата: 16.12.2021; Оператор: Шинкарев Тарас Владимирович | 22.03.1980; Долги: Нет долгов
Отдел 124->Дата: 15.12.2021; Оператор: Калинина Оксана Владимировна | 18.09.1969; Долги: Нет долгов
Отдел 108->Дата: 15.12.2021; Оператор: Калинина Оксана Владимировна | 18.09.1969; Долги: Нет долгов
Отдел 758->Не проверен";
            rez.Add(p);
            p = new Bypass()
            {
                ID = 10000000000001019682,
                DocDate = new DateTime(2020, 12, 07, 17, 35, 01),
                EventDate = new DateTime(2020, 12, 1),
                TypeName = "увольнение",
                Staff = "Москва | Региональное представительство | Менеджер по продажам",
                Remark = "ПН -746 | Нарушение финансовой дисциплины",
                ObjCaption = "Потрясилов Павел Владимирович| 10.07.1984",
                P108 = 1,
                P124 = 1,
                P138 = 0,
                P183 = 0,
                P314 = 0,
                P363 = 0,
                P405 = 0,
                P758 = 0,
                P778 = 0,
                Info = "",
                Object_id = 1000002330045370,
                ZverContract = "АДМЗР",
                Zverid = "ПОТРЯСИЛО ПВ"

            };
            p.Info = @"Отдел 138 -> Дата: 08.12.2020; Оператор: Бектемиров Марс Акылбекович|06.09.1973; Долги: Нет долгов -> Нет долгов; Прислал документ : Автопроверка остатков
Отдел 183->Дата: 08.12.2020; Оператор: Бектемиров Марс Акылбекович | 06.09.1973; Долги: Нет долгов -> Нет долгов; Прислал документ : Автопроверка остатков
Отдел 314->Дата: 08.12.2020; Оператор: Бектемиров Марс Акылбекович | 06.09.1973; Долги: Нет долгов
Отдел 405->Дата: 10.12.2020; Оператор: Петрунин Антон Александрович | 04.06.1975; Долги: Нет долгов -> Нет долгов; Прислал документ : Автопроверка остатков
Отдел 778->Дата: 08.12.2020; Оператор: Урманцев Борис Маратович | 12.11.1981; Долги: Нет долгов
Отдел 363->Дата: 09.12.2020; Оператор: Шинкарев Тарас Владимирович | 22.03.1980; Долги: Нет долгов
Отдел 124->Дата: 09.12.2020; Оператор: Калинина Оксана Владимировна | 18.09.1969; Долги: Есть долги
Отдел 108->Дата: 09.12.2020; Оператор: Калинина Оксана Владимировна | 18.09.1969; Долги: Есть долги
Отдел 758->Дата: 08.12.2020; Оператор: Бектемиров Марс Акылбекович | 06.09.1973; Долги: Нет долгов";
            rez.Add(p);
            return rez;
        }
    }


}
